In [47]:
import pandas as pd
df = pd.read_csv(r"C:\Users\md747\Downloads\messy_data.csv")

In [48]:
df

     Name           Age   Salary       City Experience Department
0   Rahul            25  50000.0    Kolkata          2         IT
1   Anita           NaN  60000.0     Mumbai          3         HR
2  Vikram            29      NaN      Delhi          4         IT
3   Suman            31  70000.0        NaN          5    Finance
4   Arjun            22  30000.0    Kolkata                    IT
5    Neha            27  55000.0     Mumbai          3        NaN
6    Riya  twenty eight  62000.0      Delhi          4  Marketing
7   Karan            35  90000.0  Bangalore         10         IT
8   Pooja            29  58000.0    Kolkata          4         HR
9  Sameer             ?  45000.0      Delhi          2    Finance

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        10 non-null     object
 1   Age         9 non-null      object
 2   Salary      9 non-null      float64
 3   City        9 non-null      object
 4   Experience  10 non-null     object
 5   Department  9 non-null      object
dtypes: float64(1), object(5)
memory usage: 612.0+ bytes

In [50]:
df.isnull().sum()

Name          0
Age           1
Salary        1
City          1
Experience    0
Department    1
dtype: int64

In [65]:
df.group_by("Department").["Salary"].mean()

SyntaxError: invalid syntax (764791765.py, line 1)